app/views/pokemons/_form.html.erb

    <%= form.label :trainer_id %>
    <%= form.collection_select :trainer_id, Trainer.all, :id, :name, propmt: true %>
---
SELECT "trainers".* FROM "trainers"