app/views/pokemons/show.html.erb

<div>
  <% @pokemon.abilities.each do |ability| %>
---
SELECT "abilities".* FROM "abilities" INNER JOIN "abilities_pokemons" ON "abilities"."id" = "abilities_pokemons"."ability_id" WHERE "abilities_pokemons"."pokemon_id" = $1  [["pokemon_id", 1]]

    <%= form.label :ability %>
    <%= form.collection_select :name, Ability.all, :name, :name, propmt: true %>
---
SELECT "abilities".* FROM "abilities"

    <%= form.label :poke_type %>
    <%= form.collection_select :name, PokeType.all, :name, :name, propmt: true %>
---
SELECT "poke_types".* FROM "poke_types"