app/controllers/abilities_controller.rb

  def index
    @abilities = Ability.all
---
SELECT "abilities".* FROM "abilities" ORDER BY "abilities"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def link_ability
    pokemon = Pokemon.find_by(id: params[:id])
    ability = Ability.find_by(name: params[:name])
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "abilities".* FROM "abilities" WHERE "abilities"."name" = $1 LIMIT $2  [["name", "stench"], ["LIMIT", 1]]