app/controllers/pokes_controller.rb

SELECT "pokes".* FROM "pokes"
---
  def index
    @pokes = Poke.all

INSERT INTO "pokes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "pika"], ["created_at", "2022-01-12 22:42:54.185915"], ["updated_at", "2022-01-12 22:42:54.185915"]]
---
  def create
    @poke = Poke.new(poke_params)

    respond_to do |format|
      if @poke.save

SELECT "pokes".* FROM "pokes" WHERE "pokes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_poke
      @poke = Poke.find(params[:id])