app/controllers/trainers_controller.rb

  def create
    @trainer = Trainer.new(trainer_params)

    respond_to do |format|
      if @trainer.save
---
INSERT INTO "trainers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "gab"], ["created_at", "2022-01-13 11:50:02.918633"], ["updated_at", "2022-01-13 11:50:02.918633"]]

    def set_trainer
      @trainer = Trainer.find(params[:id])
---
SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]