app/views/trainers/show.html.erb

<div>
  <% @trainer.pokemons.each do |poke| %>
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = $1  [["trainer_id", 1]]